app/views/videos/_form.html.erb

<script type="text/javascript">
$(document).ready(function(){

      $('#submit_button').removeAttr('disabled');


//26may015 using custom js instead of fileupload jquery
  var $validator = $("#videoupload").validate({
        rules: {
       "video[avatar]": {
                  required: true

                },
         "video_preview_hidden": {
                    required: function(element) {
                        return $('#uploads_table').children('tbody').size() == 0;
                    }
                },
          },
            errorPlacement: function(error, element) {
                 $("#show_upload_error").html("<span class='text-danger ' >Please add a video file</span>");

---
SELECT "videos".* FROM "videos" WHERE (created_at < '2014-11-27 12:02:49.724223')