app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" WHERE (created_at < '2016-08-11 07:42:35')
---
  def index
    @videos = Video.all