app/controllers/videos_controller.rb

DELETE FROM "videos" WHERE "videos"."id" = 1
---
  def index
    #@videos = Video.all
    Video.delete_database_and_files_on_server

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "show"]]
---
  def show
    @video = Video.find(params[:id])

DELETE FROM "videos" WHERE "videos"."id" = 1
---
  def new
    Video.delete_database_and_files_on_server

INSERT INTO "videos" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @video = Video.new(params[:video])
    if @video.save

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "4"]]
---
  def send_video
    @video=Video.find params[:video_id]